Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In this guide, we've covered some of the basic topics of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0, window="_blank"] specification. However, a full CDI implementation is not used under the hood. Quarkus only implements a subset of the CDI features - see also <<cdi-reference.adoc#supported_features,the list of supported features>> and <<cdi-reference.adoc#limitations,the list of limitations>>. On the other hand, there are quite a few <<cdi-reference#nonstandard_features,non-standard features>> and <<cdi-reference.adoc#build_time_apis,Quarkus-specific APIs>>. We believe that our efforts will drive the innovation of the CDI specification towards the build-time oriented developer stacks in the future.
ja_jp: このガイドでは、 link:https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0, window="_blank"] 仕様に基づくQuarkusプログラミングモデルの基本的なトピックについて説明しました。 ただし、完全なCDIの実装は、ボンネットの下では使用されていません。 QuarkusはCDI機能のサブセットのみを実装しています - <<cdi-reference.adoc#supported_features,サポートされる機能>> と <<cdi-reference.adoc#limitations,制約のリスト>> も参照ください。 一方、 <<cdi-reference#nonstandard_features,非標準的な機能>> や <<cdi-reference.adoc#build_time_apis,Quarkus固有のAPI>> もかなりあります。私たちの取り組みが、将来的にビルド時指向の開発者スタックに向けたCDI仕様の革新を促進すると信じています。

source: In this guide, you will find an <<hello_world_example,introductory example>>, the description of the <<core_features,core features>> and <<quarkus_integration,Quarkus integration>> details.
ja_jp: このガイドでは、<<hello_world_example,introductory example>>、<<core_features,core features>> の説明、<<quarkus_integration,Quarkus integration>> の詳細について説明しています。

source: In this guide, you will find an xref:hello_world_example[introductory example], the description of the xref:core_features[core features] and xref:quarkus_integration[Quarkus integration] details.
ja_jp: このガイドでは、 xref:hello_world_example[導入例] 、 xref:core_features[コア機能] の説明、 xref:quarkus_integration[Quarkusとの統合] の詳細が記載されています。

source: In this guide, you will learn how to enable application data caching in any CDI managed bean of your Quarkus application.
ja_jp: このガイドでは、QuarkusアプリケーションのCDI管理されたBeanでアプリケーションデータのキャッシングを有効にする方法について説明します。

source: In this guide, you will learn how to implement a simple CRUD application exposing data stored in *PostgreSQL* over a RESTful API.
ja_jp: このガイドでは、*PostgreSQL* に格納されたデータをRESTful APIで公開するシンプルなCRUDアプリケーションの実装方法を学びます。

source: In this latest example, you can find all the keys managed by the default cache using `KEYS my-cache-{cache-name}:*`.
ja_jp: この最新の例では、 `KEYS my-cache-{cache-name}:*` を使って、デフォルト・キャッシュで管理されているすべてのキーを見つけることができます。

source: In this mode, the `MULTI` command is queued and is only issued when the next command is executed. This next command binds the connection to the corresponding node of the Redis cluster (so it should have keys, otherwise the target node is random). All subsequent commands are targeted to that node. If some of the subsequent commands have a key that belongs to another node, the command fails on the server side. If `WATCH` is used before `MULTI`, its key(s) determine to which node the connection is bound and the subsequent `MULTI` is not queued. If `WATCH` keys belong to multiple nodes, the command fails on the client side.
ja_jp: このモードでは、 `MULTI` コマンドはキューに入れられ、次のコマンドが実行されるときにのみ発行されます。この次のコマンドによって、接続が Redis クラスターの対応するノードにバインドされます (そのため、コマンドはキーを持っている必要があり、持っていない場合のターゲットノードはランダムになります)。以降のすべてのコマンドはそのノードをターゲットとします。それ以降のコマンドの中に別のノードに属するキーを持つものがある場合、そのコマンドはサーバー側で失敗します。 `MULTI` の前に `WATCH` が使用されている場合、そのキーによって接続先のノードが決定され、その後の `MULTI` はキューに入れられません。 `WATCH` のキーが複数のノードに属している場合、コマンドはクライアント側で失敗します。

source: In this more comprehensive and complete example, we will augment a basic Quarkus application with a few simple rules to infer potential issues with the status of a home automation setup.
ja_jp: このより包括的で完全な例では、基本的な Quarkus アプリケーションにいくつかの簡単なルールを追加して、ホームオートメーション設定の状態で発生する可能性のある問題を推測します。

source: In this particular case, the observer `@Initialized(ApplicationScoped.class)` caused the initialization of the bean. However, there are other possibilities. For example, some extensions initialize components during static initialization phase.
ja_jp: この特定のケースでは、オブザーバー `@Initialized(ApplicationScoped.class)` が Bean の初期化を引き起こしました。しかし、他の可能性もあります。例えば、静的初期化フェーズでコンポーネントを初期化するエクステンションもあります。

source: In this post we mostly focus on Swagger UI, but the styling options also apply to the https://quarkus.io/guides/microprofile-graphql#graphiql-ui[GraphQL UI] and the https://quarkus.io/guides/microprofile-health#health-ui[Health UI].
ja_jp: この記事では主に Swagger UI に焦点を当てていますが、スタイリングオプションは https://quarkus.io/guides/microprofile-graphql#graphiql-ui[GraphQL UI]と https://quarkus.io/guides/microprofile-health#health-ui[Health UI] にも適用されます。

source: In this post, we want to share our journey integrating Project Leyden into Quarkus, and how we made this integration both efficient and easy to use for our users.
ja_jp: この投稿では、Project Leyden を Quarkus に統合するまでの道のり、そしてこの統合をユーザーにとって効率的かつ使いやすいものにするためにどのように取り組んだかを紹介します。

source: In this post, we will cover three different approaches to reducing the amount of magic. We will go from almost no magic to just enough to get a good developer experience. Examples from this blog post are available on https://github.com/cescoffier/quarkus-magic-control[GitHub].
ja_jp: 今回の記事では、マジックの量を減らすための3つの異なるアプローチを取り上げます。マジックをほとんど使わない状態から、良い開発者体験を得るために必要なだけの状態にしていきます。このブログ記事の例は link:https://github.com/cescoffier/quarkus-magic-control[GitHub]で公開されています。

source: In this post, we will use the first approach. The https://quarkus.io/version/main/guides/building-native-image#creating-a-container[Building a Native Executable] page explains how to use in-container build.
ja_jp: この記事では、最初のアプローチを使用します。 link:https://quarkus.io/version/main/guides/building-native-image#creating-a-container[ネイティブ実行可能ファイルの構築]のページでは、コンテナ内ビルドを使用する方法を説明しています。

source: In this reference guide we're going to describe various aspects of Quarkus configuration. A Quarkus application and Quarkus itself (core and extensions) are both configured via the same mechanism that leverages the https://github.com/smallrye/smallrye-config[SmallRye Config] API an implementation of the https://microprofile.io/project/eclipse/microprofile-config[MicroProfile Config] specification.
ja_jp: このリファレンスガイドでは、Quarkus の設定の様々な側面について説明します。Quarkus アプリケーションと Quarkus 自体 (コアとエクステンション) の両方は、 https://microprofile.io/project/eclipse/microprofile-config[MicroProfile Config] 仕様の実装である https://github.com/smallrye/smallrye-config[SmallRye Config] APIを活用した同じメカニズムを介して設定されます。

source: In this scenario, `Dev Services for PostgreSQL` launches and configures a `PostgreSQL` test container. Make sure that either `Podman` or `Docker` is installed on your computer.
ja_jp: このシナリオでは、 `Dev Services for PostgreSQL` が `PostgreSQL` テスト・コンテナを起動し、構成します。 `Podman` または `Docker` のいずれかがコンピュータにインストールされていることを確認します。

source: In this scenario, all you have to to is provide a link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] to tell Quarkus how to find, store and update your credentials (see <<Exposing your entities to Quarkus WebAuthn>>).
ja_jp: このシナリオでは、Quarkus に認証情報の検索、保存、および更新方法を伝えるために、 link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] の提供のみを実行します (詳細は <<Exposing your entities to Quarkus WebAuthn>> を参照)。

source: In this scenario, you do not need to protect your Quarkus endpoint by using the Quarkus OpenID Connect adapter.
ja_jp: このシナリオでは、Quarkus OpenID Connect アダプターを使用して Quarkus エンドポイントを保護する必要はありません。

source: In this second run you should not see a line saying it is resolving `quarkus-rest` as JBang caches the dependency resolution between runs. If you want to clear the caches to force resolution use `jbang cache clear`.
ja_jp: この 2 回目の実行では、JBang が実行の間に依存関係の解決をキャッシュするため、 `quarkus-rest` を解決しているという行は表示されないはずです。 キャッシュをクリアして強制的に解決したい場合は、 `jbang cache clear` を使用します。

source: In this second run you should not see a line saying it is resolving `quarkus-resteasy-reactive` as JBang caches the dependency resolution between runs. If you want to clear the caches to force resolution use `jbang cache clear`.
ja_jp: 1回めの実行で jbang が依存関係の解決をキャッシュしているため、2回目の実行では `quarkus-resteasy` の依存関係を解決する行は表示されません。キャッシュをクリアして強制的に解決させたい場合は `jbang cache clear` を利用します。

source: In this second run you should not see a line saying it is resolving `quarkus-resteasy` as JBang caches the dependency resolution between runs. If you want to clear the caches to force resolution use `jbang cache clear`.
ja_jp: この2回目の実行では、JBangが実行の間に依存関係の解決をキャッシュするので、 `quarkus-resteasy` を解決しているという行は表示されないはずです。キャッシュをクリアして強制的に解決したい場合は、 `jbang cache clear` を使ってください。

source: In this section we create a skeleton of our application, so that we have something that we can extend and to which we can add fault tolerance features later on.
ja_jp: このセクションでは、後でフォールトトレランス機能を追加できるよう、拡張可能なようにアプリケーションの骨組を作成します。

source: In this section we will look at how your real world OIDC requirements can be supported by complementing the configuration with the custom code.
ja_jp: このセクションでは、設定をカスタムコードで補完することにより、現実世界の OIDC 要件をどのようにサポートできるかを見ていきます。

source: In this section we will start creating the GraphQL API.
ja_jp: このセクションでは、GraphQL APIの作成を開始します。

source: In this section, we are going to consume the service we expose. To simplify, we are going to consume the service from the same application, which in the real world, does not make sense.
ja_jp: ここでは、公開しているサービスを消費することにします。簡単に言うと、同じアプリケーションからサービスを消費することになりますが、これは現実の世界では意味がありません。

source: In this section, we are going to look at the alternative, default option, where a custom callback handler is called, but after Quarkus OIDC has completed the authorization code flow.
ja_jp: このセクションでは、デフォルトの代替オプションを見ていきます。ここではカスタムコールバックハンドラーが呼び出されますが、それは Quarkus OIDC が認可コードフローを完了した後になります。

source: In this section, we create our first simple health check procedure.
ja_jp: このセクションでは、最初の簡単なヘルスチェック手順を作成します。

source: In this section, we extend our `Database connection health check` with the option of stating that our application is not ready to process requests as the underlying database connection cannot be established. For simplicity reasons, we only determine whether the database is accessible or not by a configuration property.
ja_jp: このセクションでは、 `Database connection health check` を拡張して、基礎となるデータベース接続が確立できないために、アプリケーションがリクエストを処理する準備ができていないことを示すオプションを追加します。簡略化のため、データベースにアクセスできるかどうかの判断は、設定プロパティでのみ行います。

source: In this section, we present an OpenTelemetry library that can smooth the transition by providing access to the legacy OpenTracing API. This can help with the migration of large applications with many manual instrumentation points.
ja_jp: このセクションでは、レガシーの OpenTracing API へのアクセスを提供することで移行をスムーズにする OpenTelemetry ライブラリーを紹介します。これは、多くの手動計装ポイントを持つ大規模なアプリケーションの移行に役立ちます。

source: In this section, we use JIB to build the container. Refer to the xref:./container-image.adoc[containerization guide] to learn more about the alternatives.
ja_jp: このセクションでは、JIB を使用してコンテナーをビルドします。 他の方法については、 xref:./container-image.adoc[コンテナー化ガイド] を参照してください。

source: In this section, we will explain everything you need to know about the configuration reference documentation.
ja_jp: このセクションでは、設定リファレンスドキュメントについて知っておくべきことをすべて説明します。

source: In this section, we will use an anchor created above the level-2 heading for demonstration purposes.
ja_jp: このセクションでは、デモンストレーションの目的でレベル 2 の見出しの上に作成されたアンカーを使用します。

source: In this section, you are going to learn how the Vert.x OIDC code can be converted to Quarkus OIDC.
ja_jp: このセクションでは、Vert.x OIDC のコードを Quarkus OIDC に変換する方法を学びます。

source: In this session the Quarkus Team will give you a unique, hands-on experience: An introduction to Quarkus, a follow-along hands-on demo or two and then a Q&A with some of the band, umm, developers involved.
ja_jp: このセッションでは、Quarkus チームがユニークなハンズオン体験を提供します。Quarkus の紹介、その場で行うハンズオンデモ、そしてバンドメンバー、つまり開発者数名との Q&A です。

source: In this situation, switching to JVM mode would be the best thing to try first. If the performance issues continue after switching to JVM mode, you can use more established and mature tooling to figure out the root cause. If the performance issue is limited to native mode only, you might not be able to use `perf`, so JFR is the only way to gather any information in this situation. As JFR support for native expands, the ability to detect root causes of performance issues directly in production will improve.
ja_jp: この状況では、JVM モードに切り替えることが最初に試す最善の方法です。JVM モードに切り替えた後もパフォーマンスの問題が続く場合は、より確立された成熟したツールを使用して根本原因を突き止めることができます。パフォーマンスの問題がネイティブモードのみに限定されている場合、 `perf` を使用できない可能性があるため、この状況で情報を収集するには JFR が唯一の方法です。ネイティブの JFR サポートが拡大するにつれて、パフォーマンスの問題の根本原因を本番環境で直接検出する機能が向上します。

source: In this situation, system properties such as `javax.net.ssl.trustStore` do not have an effect at run time, so when the defaults need to be changed, these system properties must be provided at image build time. The easiest way to do so is by setting `quarkus.native.additional-build-args`. For example:
ja_jp: このような状況では、 `javax.net.ssl.trustStore` のようなシステムプロパティは実行時には効果がないので、デフォルトを変更する必要がある場合には、これらのシステムプロパティをイメージのビルド時に提供する必要があります。最も簡単な方法は、 `quarkus.native.additional-build-args` を設定することです。例えば、以下のようになります。

source: In this step we will start an LRA but not end it when the method finishes by using https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ws/rs/LRA.html#end--[the end element of the LRA annotation].
ja_jp: このステップでは https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ws/rs/LRA.html#end--[LRAアノテーションのエンド要素] を使用することで、LRAを開始しますが、メソッドが終了してもLRAを終了しません。

source: In this step we will start an LRA running in one service and then kill the service before the LRA has finished. Then we'll use a second service to end the LRA and note that second service completes but that the LRA will still be in the `Closing` state because the participant in the first, failed, service still needs to complete. If the LRA is to reach the `Closed` state then the failed service must be restarted so that it can can respond to the `Complete` request.
ja_jp: このステップでは、あるサービスでLRAの実行を開始し、LRAが終了する前にサービスを終了させます。次に、2つ目のサービスを使用してLRAを終了させます。2つ目のサービスは完了しますが、最初に失敗したサービスの参加者がまだ完了する必要があるため、LRAはまだ `Closing` の状態にあります。LRAが `Closed` の状態になるには、失敗したサービスを再起動して、 `Complete` の要求に応答できるようにする必要があります。

source: In this style, the configuration names in the profile aware file do not need to be prefixed with the profile name.
ja_jp: このスタイルでは、プロファイル対応ファイルの設定名の前にプロファイル名を付ける必要はありません。

source: In this style, the configuration names in the profile-aware file do not need to be prefixed with the profile name.
ja_jp: このスタイルでは、プロファイル対応ファイルの設定名の前にプロファイル名を付ける必要はありません。

source: In this test the `mockableBean2` is configured, so it returns the configured response.
ja_jp: このテストでは、 `mockableBean2` が設定されているので、設定されたレスポンスを返します。

source: In this tutorial a Codestart project is created from a Quarkus project and adding the needed templates.
ja_jp: このチュートリアルでは、Quarkus プロジェクトから Codestart プロジェクトを作成し、必要なテンプレートを追加します。

source: In this tutorial though, we will use a recently added `OidcTestClient` to support testing endpoints which use live Auth0 development tenants.
ja_jp: ただしこのチュートリアルでは、最近追加された `OidcTestClient` を使用して、ライブ Auth0 開発テナントを使用するエンドポイントのテストをサポートします。

source: In this tutorial you have already configured the OIDC `hybrid` application which can handle both authorization code and bearer token authentication flows. In production you will run microservices as separate servers but for the sake of simplicity `ApiEchoService` will not have to be started as a second server with its own configuration containing `quarkus.oidc.auth-server-url=https://dev-3ve0cgn7.us.auth0.com` only, and therefore the current configuration which already has the Auth0 dev tenant address configured will be reused.
ja_jp: このチュートリアルでは、認可コードとベアラートークン認証フローの両方を処理できる OIDC `hybrid` アプリケーションをすでに設定しています。実稼働環境ではマイクロサービスを別のサーバーとして実行しますが、ここではわかりやすくするために、 `ApiEchoService` を `quarkus.oidc.auth-server-url=https://dev-3ve0cgn7.us.auth0.com` のみを含む独自の設定を持つ 2 番目のサーバーとして起動する必要はありません。そのため、Auth0 開発テナントアドレスがすでに設定されている現行の設定が再利用されます。

source: In this tutorial, a PostgreSQL database is used for the identity store. link:https://hibernate.org/orm/[Hibernate ORM] automatically creates the database schema on startup. This approach is suitable for development but is not recommended for production. Therefore, adjustments are needed in a production environment.
ja_jp: このチュートリアルでは、アイデンティティーストアに PostgreSQL データベースを使用します。 link:https://hibernate.org/orm/[Hibernate ORM] は起動時にデータベーススキーマを自動的に作成します。 このアプローチは開発には適していますが、実稼働環境には推奨されません。 したがって、実稼働環境では調整が必要になります。

source: In this tutorial, a PostgreSQL database is used for the identity store. Hibernate ORM automatically creates the database schema on startup (change this in production).
ja_jp: このチュートリアルでは、PostgreSQL データベースを ID ストアに使用します。Hibernate ORM は起動時にデータベーススキーマを自動的に作成します (運用時にはこれを変更します)。

source: In this tutorial, we are going to include code from a separate Java file using tags.
ja_jp: このチュートリアルでは、タグを使用して別の Java ファイルからのコードを含めます。

source: In translation files, use positional variables (${0}, ${1}, …):
ja_jp: 翻訳ファイルでは、位置変数 (${0}, ${1}, …) を使用します。

source: In trying to decide how to handle the question of tuning, we ended up referring back to the guiding principles for the whole exercise. They were:
ja_jp: チューニングの問題をどのように扱うかを決めようとする中で、私たちはこの取り組み全体の基本原則に立ち返ることになりました。それらは次のとおりです。

source: In turn, code such as `if (logger.isDebugEnabled()) callMethod();` is identified as never executed, also known as dead code.
ja_jp: その結果、 `if (logger.isDebugEnabled()) callMethod();` のようなコードは決して実行されないと識別され、デッドコードとして扱われます。

source: In very exotic scenarios, if you need to prevent usage of CDI in a converter/listener even though it uses CDI annotations (`@Inject`, ...), annotate it with `@Vetoed`. The class will then be instantiated by Hibernate ORM through its default constructor.
ja_jp: 非常に特殊なシナリオで、CDI アノテーション ( `@Inject` など) を使用しているにもかかわらず、コンバーター/リスナーでの CDI の使用を抑制する必要がある場合は、 `@Vetoed` を付与してください。その場合、クラスは Hibernate ORM によってデフォルトコンストラクターを介してインスタンス化されます。

source: In which cases could conditional dependencies be useful? A typical example would be a component that should be activated **only** in case all of its required dependencies are available. If one or more of the component's required dependencies aren't available, instead of failing, the component should simply not be activated.
ja_jp: 条件付き依存関係はどのような場合に役立つのでしょうか。典型的な例は、必要な依存関係がすべて利用可能な場合に *のみ* 起動されるべきコンポーネントです。そのコンポーネントの必要な依存関係が1つ以上利用できない場合、失敗するのではなく、単にそのコンポーネントをアクティブにしないようにします。

source: In xref:dev-ui.adoc#jsonrpc-against-the-deployment-classpath[deployment-time] code, you need to add the assistant-deployment-spi:
ja_jp: xref:dev-ui.adoc#jsonrpc-against-the-deployment-classpath[デプロイ時] のコードでは、 assistant-deployment-spi を追加する必要があります:

source: In xref:quarkus_integration[Quarkus], the engine used to format the messages is the same as the one injected by `@Inject Engine`. Therefore, you can make use of any Quarkus-specific integration feature such as xref:template_extension_methods[Template Extension Methods], xref:injecting-beans-directly-in-templates[Injecting Beans Directly In Templates] or even xref:type-safe-message-bundles[Type-safe Message Bundles].
ja_jp: xref:quarkus_integration[Quarkus] では、メッセージをフォーマットするために使用されるエンジンは、 `@Inject Engine` によって注入されるものと同じです。したがって、 xref:template_extension_methods[テンプレート] 拡張メソッド、 xref:injecting-beans-directly-in-templates[テンプレートへの直接注入] 、 xref:type-safe-message-bundles[タイプセーフメッセージバンドル] など、Quarkus固有の統合機能を利用することができます。

source: In your HTTP endpoint class, inject the event bus and uses the `request` method to send a message to the event bus and expect a response:
ja_jp: HTTPエンドポイントクラスでは、イベントバスを注入し、 `request` メソッドを使用して、イベントバスにメッセージを送信し、応答を期待します。

source: In your Quarkus application, it is possible to use annotations to select an authentication mechanism specific to each Jakarta REST endpoint:
ja_jp: Quarkus アプリケーションでは、アノテーションを使用して、各 Jakarta REST エンドポイントに固有の認証メカニズムを選択できます。

source: In your Quarkus terminal, type 'r' to run the tests. You should see that your application changes broke the tests!
ja_jp: Quarkus ターミナルで 'r' と入力してテストを実行します。 アプリケーションの変更によってテストが失敗したことを確認できます。

source: In your Runtime or Runtime-dev module, create the JsonRPC Service. This class will default to an application-scoped bean, except if you explicitly scope the bean. All public methods that return something will be made available to call from the Web component Javascript.
ja_jp: Runtime または Runtime-dev モジュールで JsonRPC サービスを作成します。このクラスは、Bean を明示的にスコープ指定しない場合を除き、デフォルトでアプリケーションスコープの Bean となります。何かを返すすべての public メソッドは、Web コンポーネントの Javascript から呼び出し可能になります。

source: In your Webcomponent, you can then stream the log to the UI:
ja_jp: Webcomponent では、ログを UI にストリーミングできます。

source: In your `@QuarkuTest`, you can use `@InjectMock` to inject the Mutiny client of a gRPC service:
ja_jp: `@QuarkuTest` では、 `@InjectMock` を使って gRPC サービスの Mutiny クライアントを注入することができます:

source: In your `@QuarkusTest`, you can use `@InjectMock` to inject the Mutiny client of a gRPC service:
ja_jp: `@QuarkusTest` では、 `@InjectMock` を使用して、gRPC サービスの Mutiny クライアントを注入できます：

source: In your `Dockerfile`, just use:
ja_jp: `Dockerfile` の中で以下を記述します:

source: In your `pom.xml`, add the following dependencies:
ja_jp: ビルドファイルに、以下の依存関係を追加します:

source: In your application, create a SQL file named `001-devservice-init.sql` (for ordering purposes, it can be any name really) in your `src/main/resources` with the following content:
ja_jp: アプリケーションの `src/main/resources` に、`001-devservice-init.sql` という名前の SQL ファイル (順序付けのためであり、実際にはどのような名前でも構いません) を次の内容で作成します。

source: In your browser, go to `http://localhost:8080/coffee/2/recommendations` and hit refresh a couple of times.
ja_jp: お使いのブラウザで `http://localhost:8080/coffee/2/recommendations` にアクセスして、2、3回更新してください。

source: In your build file you should see 2 test dependencies:
ja_jp: ビルドファイルには、2 つのテスト依存関係が表示されます。

source: In your build file, add the following dependencies:
ja_jp: ビルドファイルに、以下の依存関係を追加します:

source: In your build file, add:
ja_jp: ビルドファイルに、以下を追加します。

source: In your extension's runtime module, create a `MyJsonRPCService` class with a `getMyUrl` method.
ja_jp: エクステンションのランタイムモジュールで、 `getMyUrl` メソッドを持つ `MyJsonRPCService` クラスを作成します。

source: In your extension:
ja_jp: エクステンションの中で:

source: In your pom.xml file, just add the following dependency:
ja_jp: pom.xmlファイルに以下の依存関係を追加します:

source: In-Memory Reactive Messaging
ja_jp: インメモリ・リアクティブ・メッセージング

source: In-Person and online events which feature Quarkus tracks, discussion and topics.
ja_jp: Quarkusのトラック、ディスカッション、トピックを取り上げた対面およびオンラインイベント。

source: In-container build allows building Linux 64 executables by using a `native-image` compiler running in a container. It avoids having to install `native-image` on your machine, and also allows configuring the GraalVM version you need. Note that, to use in-container build, you must have Docker or Podman installed on your machine.
ja_jp: コンテナー内ビルドでは、コンテナー内で動作する `native-image` コンパイラを使用して Linux 64 実行可能ファイルをビルドできます。 これは、 `native-image` をマシンにインストールする手間を省き、必要な GraalVM バージョンを設定することもできます。 コンテナー内ビルドを使用するには、DockerまたはPodmanがマシンにインストールされている必要があることに注意してください。

source: In-memory channels
ja_jp: インメモリーチャンネル

source: In-memory connector is solely intended for testing purposes. There are some caveats to consider when using the in-memory connector:
ja_jp: in-memory コネクターはテスト目的のみに使用されます。 in-memory コネクターを使用する際に考慮すべき注意事項がいくつかあります。
